[
    {
        "name" : "Project laravel",
        "img" : "assets/img/project8.jpg",
        "languages" : ["Laravel","JavaScript","MySQL"],
        "desc" : "The theme of this project is a dynamic web application whose goal is the realization of reservations for different property objects. The project is divided into two parts. The admin part(admin panel) and access to this part is only available to users with the role of administrator. The admin can perform the entire CRUD on all entities. in the project. The second part is intended for other users who search, filter and reserve objects.",
        "github" : "https://github.com/LazarevicFilip/vacationrental"
    },
	{
        "name" : "Upload files on aws s3",
        "img" : "assets/img/project9.jpg",
        "languages" : ["Laravel","MySQL"],
        "desc" : "The project does not form a logical unit, but processes certain functionalities such as: file upload to aws s3, email sending, user authentication. After successful registration, the user's image is uploaded to aws s3 and a welcome email is sent to the user.",
        "github" : "https://github.com/LazarevicFilip/uploadFile_sendEmail"
    },
    {
        "name" : "Project web programming PHP 2",
        "img" : "assets/img/project7.jpg",
        "languages" : ["HTML5","CSS3","JavaScript","PHP","MySQL"],
        "desc" : "The project is a dynamic web application. The topic of this project is music events for which users buy tickets. Data is pulled from the database. Functionalities are registration/login, server pagination, sorting, filtering, admin panel with CRUD operations, image resizing and shopping cart. Email sending via PHPMailer in case of a successful purchase or sending an info email about locking the account",
        "github" : "https://github.com/LazarevicFilip/djevents",
        "href" : "https://djevent-app.000webhostapp.com/"
    },
    {
        "name" : "Project web programming PHP 1",
        "img" : "assets/img/project6.jpg",
        "languages" : ["HTML5","CSS3","JavaScript","PHP","MySQL"],
        "desc" : "My first dynamic site. The theme of this project is a blog post where users register and write blogs,  comments, etc. The data is pulled from the database. The database server is MySQL, and the connection to the database is made through an instance of the PDO object. Functionalities such as: registration/login, pagination, comments, admin panel with CRUD operations.",
        "github" : "https://github.com/LazarevicFilip/watchtime",
        "href" : "https://watchtime-app.000webhostapp.com/"
    },
    {
        "name" : "Project web programming 2",
        "img" : "assets/img/project5.jpg",
        "languages" : ["HTML5","CSS3","JavaScript","AJAX"],
        "desc" : "The accent on this project was the JavaScript parts like Ajax and Local Storage. The data was written in JSON files that were fetched by AJAX and were dynamically displayed, then filtered and sorted by choice. Work with callback functions for processing asynchronous operations.",
        "github" : "https://github.com/LazarevicFilip/gamesland",
        "href" : "https://gamesland.netlify.app"
    },
    {
        "name" : "Project web programming 1",
        "img" : "assets/img/project4.jpg",
        "languages" : ["HTML5","CSS3","JavaScript","JQuery"],
        "desc" : "My first project in which JavaScript is integrated. The site is interactive and the areas covered are: dynamic printing and content processing, form processing, validation + RegEx, Jquery, JQuery plugin...",
        "github" : "https://github.com/LazarevicFilip/mobshop",
        "href" : "https://mob-shop1.netlify.app"
    },
    {
        "name" : "Project web design 1",
        "img" : "assets/img/project1.jpg",
        "languages" : ["HTML","CSS"],
        "desc" : "My first ever project. The goal of this project is to get familiar with HTML as a web site structure and CSS for styling sites. In addition, the emphasis is on SEO and XML.",
        "github" : "https://github.com/LazarevicFilip/coffeFirst",
        "href" : "https://coffefirst.netlify.app"
    },
    {
        "name" : "Project web design 2",
        "img" : "assets/img/project2.jpg",
        "languages" : ["HTML5","CSS3","SCSS"],
        "desc" : "The goal of this project is to get familiar with SASS (SCSS) as well as with responsive Web (media query) which is everyday in today's web.",
        "github" : "https://github.com/LazarevicFilip/webdizajnprojekat2",
        "href" : "https://portfolio-designer.netlify.app"
    },
    {
        "name" : "Project web design 3",
        "img" : "assets/img/project3.jpg",
        "languages" : ["HTML5","CSS3","SCSS","Bootstrap","Materialize"],
        "desc" : "The goal of this project is to work with CSS frameworks such as Bootstrap and Materialize. In this project, the first 3 pages were made in Bootstrap and the rest in Materialize.",
        "github" : "https://github.com/LazarevicFilip/blokinvest",
        "href" : "https://blokinvest.netlify.app"
    }    
   
]